Ping-Hsueh-Hsieh/stm32n6-camera/Application/NUCLEO-N657X0-Q/Src/main.c
static void IAC_Config(void)
{
/* Configure IAC to trap illegal access events */
  __HAL_RCC_IAC_CLK_ENABLE();
  __HAL_RCC_IAC_FORCE_RESET();
  __HAL_RCC_IAC_RELEASE_RESET();
}

void IAC_IRQHandler(void)
{
  while (1)
  {
  }
}

/**
* @brief Display Neural Network output classification results as well as other performances informations
*
* @param inference_ms inference time in ms
*/
static void Display_NetworkOutput(uint32_t inference_ms)
{
  int ret;

  __disable_irq();
  ret = SCRL_SetAddress_NoReload(lcd_fg_buffer[lcd_fg_buffer_rd_idx], SCRL_LAYER_1);
  assert(ret == HAL_OK);
  __enable_irq();

  UTIL_LCD_Clear(0x0ULL);

  /* Scale boxes from the 96x96 NN input to the LCD foreground area */
  float sx = (float)LCD_FG_WIDTH / NN_IMG_SIZE;
  float sy = (float)LCD_FG_HEIGHT / NN_IMG_SIZE;

  for (int i = 0; i < detection_count; i++)
  {
    uint32_t x = (uint32_t)(detections[i].x * sx);
    uint32_t y = (uint32_t)(detections[i].y * sy);
    uint32_t w = (uint32_t)(detections[i].w * sx);
    uint32_t h = (uint32_t)(detections[i].h * sy);

    UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_YELLOW);
    UTIL_LCD_DrawRect(x, y, w, h, UTIL_LCD_COLOR_YELLOW);
    UTIL_LCDEx_PrintfAt(x, y, LEFT_MODE, "%s %.0f%%", classes_table[detections[i].cls], detections[i].score * 100);
  }

  UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_WHITE);
  UTIL_LCDEx_PrintfAt(0, LINE(18), CENTER_MODE, "%d object(s) | Inference: %ums", detection_count, inference_ms);

  Display_WelcomeScreen();

  SCB_CleanDCache_by_Addr(lcd_fg_buffer[lcd_fg_buffer_rd_idx], LCD_FG_FRAMEBUFFER_SIZE);
  __disable_irq();
  ret = SCRL_ReloadLayer(SCRL_LAYER_1);
  assert(ret == HAL_OK);
  __enable_irq();
  lcd_fg_buffer_rd_idx = 1 - lcd_fg_buffer_rd_idx;
}

/**
 * @brief Compute Intersection over Union between two detections
 */
static float Compute_IoU(DetBox_t *a, DetBox_t *b)
{
  uint32_t x0 = (a->x > b->x) ? a->x : b->x;
  uint32_t y0 = (a->y > b->y) ? a->y : b->y;
  uint32_t x1 = ((a->x + a->w) < (b->x + b->w)) ? (a->x + a->w) : (b->x + b->w);
  uint32_t y1 = ((a->y + a->h) < (b->y + b->h)) ? (a->y + a->h) : (b->y + b->h);

  uint32_t inter = ((x1 > x0) && (y1 > y0)) ? (x1 - x0) * (y1 - y0) : 0;
  uint32_t union_area = a->w * a->h + b->w * b->h - inter;

  return (union_area > 0) ? ((float)inter / (float)union_area) : 0.0f;
}

/**
 * @brief Decode YOLOv8 detections from the network output
 *
 * The network output is a quantized S8 tensor [84][189] (CHW): the first 4
 * rows hold the decoded box coordinates (cx, cy, w, h) normalized to [0, 1]
 * (restore pixels by multiplying by 255), rows 4..83 hold the already
 * sigmoided scores of the 80 COCO classes. 189 is the number of anchors
 * (12x12 + 6x6 + 3x3). Scale and zero point are read at runtime from the
 * generated model info; values are dequantized with real = (q - zp) * scale.
 */
void Network_Postprocess(void)
{
  const int8_t *out = (const int8_t *)pp_input;
  const float scale = nn_out_scale;
  const int32_t zp = nn_out_zp;

  detection_count = 0;

  for (int i = 0; i < YOLO_ANCHORS; i++)
  {
    uint16_t best_cls = 0;
    float best_score = 0.0f;

    for (int c = 0; c < YOLO_NC; c++)
    {
      float s = ((float)out[(4 + c) * YOLO_ANCHORS + i] - zp) * scale;
      if (s > best_score)
      {
        best_score = s;
        best_cls = c;
      }
    }

    if (best_score < YOLO_CONF)
      continue;

    float cx = (((float)out[0 * YOLO_ANCHORS + i] - zp) * scale) * YOLO_BOX_UNNORM;
    float cy = (((float)out[1 * YOLO_ANCHORS + i] - zp) * scale) * YOLO_BOX_UNNORM;
    float w = (((float)out[2 * YOLO_ANCHORS + i] - zp) * scale) * YOLO_BOX_UNNORM;
    float h = (((float)out[3 * YOLO_ANCHORS + i] - zp) * scale) * YOLO_BOX_UNNORM;

    if ((w <= 0.0f) || (h <= 0.0f))
      continue;

    DetBox_t d;
    int x = (int)(cx - w / 2.0f);
    int y = (int)(cy - h / 2.0f);
    int bw = (int)w;
    int bh = (int)h;

    if (x < 0)
      x = 0;
    if (y < 0)
      y = 0;
    if ((x + bw) > NN_IMG_SIZE)
      bw = NN_IMG_SIZE - x;
    if ((y + bh) > NN_IMG_SIZE)
      bh = NN_IMG_SIZE - y;

    d.x = (uint16_t)x;
    d.y = (uint16_t)y;
    d.w = (uint16_t)bw;
    d.h = (uint16_t)bh;
    d.cls = best_cls;
    d.score = best_score;

    if (detection_count < YOLO_MAX)
      detections[detection_count++] = d;
  }

  /* Greedy NMS */
  for (int i = 0; i < detection_count; i++)
  {
    for (int j = i + 1; j < detection_count; j++)
    {
      if (Compute_IoU(&detections[i], &detections[j]) > YOLO_IOU)
      {
        detections[j] = detections[--detection_count];
        j--;
      }
    }
  }
}

static void Display_init(void)
{
  SCRL_LayerConfig layers_config[2] = {
    {
      .origin = {lcd_bg_area.X0, lcd_bg_area.Y0},
      .size = {lcd_bg_area.XSize, lcd_bg_area.YSize},
      .format = SCRL_RGB565,
      .address = lcd_bg_buffer,
    },
    {
      .origin = {lcd_fg_area.X0, lcd_fg_area.Y0},
      .size = {lcd_fg_area.XSize, lcd_fg_area.YSize},
      .format = SCRL_ARGB4444,
      .address = lcd_fg_buffer[lcd_fg_buffer_rd_idx],
    },
  };
  SCRL_ScreenConfig screen_config = {
    .size = {LCD_FG_WIDTH, LCD_FG_HEIGHT},
#ifdef SCR_LIB_USE_SPI
    .format = SCRL_RGB565,
#else
    .format = SCRL_YUV422, /* Use SCRL_RGB565 if host support this format to reduce cpu load */
#endif
    .address = screen_buffer,
    .fps = CAMERA_FPS,
  };
  int ret;

  /* Initialize the LCD to black */
#ifdef SCR_LIB_USE_SPI
  memset(screen_buffer, 0, sizeof(screen_buffer));
  SCB_CleanDCache_by_Addr(screen_buffer, sizeof(screen_buffer));
#else
  uint32_t *p_screen_buffer = (uint32_t *) screen_buffer;
  for (int i = 0; i < sizeof(screen_buffer)/4; i++)
  {
    p_screen_buffer[i] = 0x80108010;
  }
  SCB_CleanDCache_by_Addr(screen_buffer, sizeof(screen_buffer));
#endif

  ret = SCRL_Init((SCRL_LayerConfig *[2]){&layers_config[0], &layers_config[1]}, &screen_config);
  assert(ret == 0);

  UTIL_LCD_SetLayer(SCRL_LAYER_1);
  UTIL_LCD_Clear(UTIL_LCD_COLOR_TRANSPARENT);
  UTIL_LCD_SetFont(&Font12);
  UTIL_LCD_SetBackColor(0x40000000);
  UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_WHITE);
}

/**
 * @brief Displays a Welcome screen
 */
static void Display_WelcomeScreen(void)
{
  static uint32_t t0 = 0;
  if (t0 == 0)
    t0 = HAL_GetTick();

